#include "errno.h"
#include "log.h"
#include "gtest/gtest.h"
#include <stdio.h>
#include <stdlib.h>

// 单调栈：

/*
问题1：给定一个数组，输出相同大小的数组， 输出数组的每个元素满足如下规则“
1、数组中地i个元素为，元素组中第i个元素到后面大于元素组的距离，如果后面没有大于原数组的值，则该值为-1
例子：
input: 5, 3, 1, 2, 4
output: -1, 3, 1, 1, -1
*/

/*
解法思路：
{0} [-1, -1, -1, -1, -1]
{0, 1} [-1, -1, -1, -1, -1]
{0, 1, 2} [-1, -1, -1, -1, -1]
{0, 1, 2, 3} => 把所有小于2的值pop出来，按照pop次数给对应索引置位（必须要保证之前没有设置过）
=》将所有的东西放回到栈中 =》[-1, -1, 1, -1, -1]
{0, 1, 2, 3, 4} [-1, 3, 1, 1, -1]
*/

TEST(single_, test1)
{
    printf("test1: hello");
}